fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ДобавитьЭлементыВКМ(); 
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// ++ Арканов Д.Ю. доработка дипломной работы
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ДобавитьЭлементыВКМ();
	Иначе
		УдалитьЭлементыВКМ(); 
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьЭлементыВКМ()
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	НовыйЭлемент.Заголовок = "Дата начала";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	НовыйЭлемент.Заголовок = "Дата окончания";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	НовыйЭлемент.Заголовок = "Абонентская плата";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	НовыйЭлемент.Заголовок = "Стоимость часа";
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыВКМ()
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	Если Элементы.Найти("ВКМ_ДатаНачала") <> Неопределено Тогда
			
		ИменаУдаляемыхЭлементов = Новый Массив;
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_ДатаНачала");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_ДатаОкончания");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_АбонентскаяПлата");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_СтоимостьЧаса");
		
		Для Каждого ЭлементМассива Из ИменаУдаляемыхЭлементов Цикл
			Элементы.Удалить(Элементы[ЭлементМассива]);
			Объект[ЭлементМассива] = Неопределено;
		КонецЦикла;
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

#КонецОбласти
